#+TITLE: Features
#+Last Saved: <Nov 18, 2019>

* TODO helm-ag


(setq helm-grep-ag-command "C:\\opt\\ripgrep\\rg.exe --color=always --colors 'match:fg:black' --colors 'match:bg:yellow' --smart-case --no-heading --line-number %s %s %s")
(setq helm-grep-ag-pipe-cmd-switches '("--colors 'match:fg:black'" "--colors 'match:bg:yellow'"))

#+BEGIN_SRC emacs-lisp
(setq helm-grep-ag-command "C:\\opt\\ripgrep\\rg.exe --smart-case --no-heading --line-number %s %s %s")
(setq helm-grep-ag-pipe-cmd-switches '("--colors 'match:fg:black'" "--colors 'match:bg:yellow'"))
#+END_SRC

#+RESULTS:
| --colors 'match:fg:black' | --colors 'match:bg:yellow' |


* nice tabs
https://github.com/ema2159/centaur-tabs

* Buffer Management

** TODO window-purpose

Windows layout and buffer grouping inside the layout
https://github.com/bmag/emacs-purpose
https://www.reddit.com/r/emacs/comments/2zr4pc/a_quick_praise_of_purpose_mode/
